---
kind: property
id: P:Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.Rounding
source: html/b9ef8d36-4db4-e07b-7bb6-55e1f0985afd.htm
---
# Autodesk.Revit.DB.Analysis.AnalysisDisplayLegendSettings.Rounding Property

Rounding increment for numeric values of analysis results.

## Syntax (C#)
```csharp
public double Rounding { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentsInconsistentException** - When setting this property: rounding is not positive